/**
 * 滑动窗口
 * <p>一、定长滑动窗口:</p>
 * 基础
 * <ol>
 *     <li>1456. 定长子串中元音的最大数目</li>
 *     <li>643.子数组最大平均数 I</li>
 *     <li>1343.大小为 K 且平均值大于等于阈值的子数组数目</li>
 * </ol>
 * 进阶
 * <ol>
 *     <li>3679.使库存平衡的最少丢弃次数</li>
 * </ol>
 *
 * <p>二、不定长滑动窗口:</p>
 * <ol>
 *     <li></li>
 * </ol>
 *
 * <p>三、单序列双指针</p>
 * <ol>
 *     <li></li>
 * </ol>
 *
 * <p>四、双序列双指针</p>
 * <ol>
 *     <li></li>
 * </ol>
 *
 * <p>五、三指针</p>
 * <ol>
 *     <li></li>
 * </ol>
 *
 * <p>六、分组循环</p>
 * <ol>
 *     <li></li>
 * </ol>
 */

package com.oycm.algorithm.a;