package com.oycm.dualweek.lc2026.No188;

public class Solution_4 {

    /**
     * 最小化最大可能等待时间©leetcode
     * @param demand
     * @param fuel
     * @return
     */
    public int minMaxWaitingTime(int[] demand, int[] fuel) {
        /*
        给你一个整数数组 demand，其中 demand[i] 是第 i 辆车需要的燃料量。
        同时给你一个长度为 2 的整数数组 fuel。有 恰好 两个加油机，编号为 0 和 1，其中 fuel[j] 是加油机 j 中可用的初始燃料量。
        允许车辆按 递增 的下标顺序开始加油。第 0 辆车在时间 0 被允许加油，对于每个 i > 0，第 i 辆车 恰好 在第 i - 1 辆车开始加油时被允许加油。
        加油过程遵循以下规则：
            每个加油机一次 最多 只能服务一辆车。
            车辆可以在被允许时 或之后的 任意时间开始加油。
            只有当加油机空闲且剩余燃料 至少 为 demand[i] 时，车辆才能在该加油机开始加油。
            如果有多个空闲的加油机可以服务当前车辆，你可以选择其中的 任意 一个。
            给一辆车加油需要 demand[i] 秒，并将该加油机的剩余燃料减少 demand[i]。
            一旦开始，加油过程不能被中断。
            当两个加油机都空闲时，如果没有任何一个加油机的剩余燃料 至少 为 demand[i]，则过程终止，且无法再服务更多车辆。
        车辆的 等待时间 是从它被允许开始加油到实际开始加油之间的时间。
        在 最大化 被服务车辆数量的所有分配方案中，返回所有被服务车辆中 最大 等待时间的 最小 可能值。如果没有车辆可以被服务，返回 -1。©leetcode
         */
        /*
        1 <= demand.length <= 50
        1 <= demand[i] <= 20
        fuel.length == 2
        1 <= fuel[i] <= 50
         */

        return 0;
    }


}
